Repository: Ismael-sang98/Uni_Flow_app
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTitle
source: Student Planner
tr: Öğrenci Planlayıcı

source: Schedule
tr: Ders Programı

source: Settings
tr: Ayarlar

# welcomeTitle
source: Organize your success.
tr: Başarınızı organize edin.

# welcomeSubtitle
source: Classes, homework, exams... Your entire schedule in your pocket.
tr: Dersler, ödevler, sınavlar... Tüm programınız cebinizde.

# getStartedButton
source: Start now
tr: Şimdi başla

# ajoutMatiereErreur
source: Add at least one more material!
tr: En az bir malzeme daha ekleyin!

# profilEnregistre
source: Profile updated!
tr: Profil güncellendi!

# labProfil
source: My Profile
tr: Profilim

# labMatiere
source: My Recorded Lessons
tr: Kaydettiğim Dersler

# aucuneMatiere
source: No defined subject Lessons.
tr: Tanımlanmış bir ders yok.

# labCrPr
source: Create my profile
tr: Profilimi oluştur

# labMdPr
source: Edit profile
tr: Profili düzenle

# btMod
source: Edit
tr: Düzenleme

# labNom
source: Full name
tr: Ad Soyad

# labFkt
source: Faculty
tr: Bölüm

# labCl
source: Class
tr: Sınıf

# labEc
source: School
tr: Okul

# labSsMat
source: Enter your lessons
tr: Derslerinizi girin

# hintAjoutMatiere
source: Examples: Mathematics...
tr: Örnekler: Matematik...

# btnEnregistrerProfil
source: Save profile
tr: Profili kaydet

# addTask
source: New Duty
tr: Yeni Görev

# taskTitle
source: Title
tr: Başlık

source: Notes Library
tr: Notlar

# addNote
source: New Note
tr: Yeni Not

# noteTitle
source: Title
tr: Başlık

# noteSubject
source: Subject
tr: Ders

# noteContent
source: Content
tr: İçerik

# noteTags
source: Tags (comma separated)
tr: Etiketler (virgülle ayrılmış)

# noteRequiredFields
source: Title and content are required.
tr: Başlık ve İçerik zorunludur.

# noteImages
source: Images
tr: Gorseller

# addFromGallery
source: Gallery
tr: Galeri

# addFromCamera
source: Camera
tr: Kamera

source: No images yet.
tr: Henuz gorsel yok.

# noteTagsHelp
source: Tags help you group and search notes (e.g. exam, chapter).
tr: Etiketler notları gruplar ve aramayı kolaylaştırır (or: sınav, konu).

# notesEmpty
source: No notes yet.
tr: Henuz not yok.

source: Note details
tr: Not detayları

source: Edit note
tr: Notu düzenle

# noteCreatedAt
source: Created on {date}
tr: Olusturma: {date}

# noteUpdatedAt
source: Updated on {date}
tr: Güncelleme: {date}

# mt
source: Lessons
tr: Ders

# noSubjectsDefined
source: No lessons defined in the profile
tr: Profilde tanımlanmış ders yok.

# dueDate
source: For the :
tr: Tarih :

# rejet
source: Cancel
tr: İptal

# ajt
source: Add
tr: Ekle

# bvn
source: Welcome !
tr: Hoş geldin !

source: Planning
tr: Takvim

source: Tasks
tr: Görevler

# pleaseSelectASubject
source: Please select a material.
tr: Lütfen bir ders seçin.

# endTimeMustBeAfterStartTime
source: The end must come after the beginning.
tr: Başlangıcın ardından son gelmelidir.

# addCourse
source: Add a course
tr: Ders ekle

# noSubjectMnessage
source: No course found!
tr: Hiçbir dersi bulunamadı!

# noSubjectExplanation
source: You must first define your subjects in your Profile (pencil icon).
tr: Öncelikle Profilinizde (kalem simgesi) ders konularınızı belirlemelisiniz.

# goBack
source: Back
tr: Geri

# location
source: Room
tr: Sınıf

source: Day
tr: Gün

# j1
source: Monday
tr: Pazartesi

# j2
source: Tuesday
tr: Salı

# j3
source: Wednesday
tr: Çarşamba

# j4
source: Thursday
tr: Perşembe

# j5
source: Friday
tr: Cuma

# j6
source: Saturday
tr: Cumartesi

# j7
source: Sunday
tr: Pazar

# startLab
source: Start
tr: Başlangıç

# endLab
source: End
tr: Son

# selectColor
source: Color
tr: Renk

# savePlan
source: Add to planning
tr: Takvime ekle

# videLab
source: Nothing planned
tr: Planlanmış bir şey yok.

# videTacheLab
source: There is no task.
tr: Hiçbir görev yok.

# jAb1
source: Mon
tr: Pzt

# jAb2
source: Tue
tr: Sal

# jAb3
source: Wed
tr: Çar

# jAb4
source: Thu
tr: Per

# jAb5
source: Fri
tr: Cum

# jAb6
source: Sat
tr: Cmt

# jAb7
source: Sun
tr: Paz

# confirmSupprTitle
source: Confirm deletion
tr: Silme işlemini onaylayın

# mess1
source: Do you really want to delete it?
tr: Gerçekten silmek istiyor musunuz?

# mess2
source: This action is irreversible.
tr: Bu işlem geri döndürülemez.

# supp
source: Delete
tr: Sil

# labLocation
source: Unspecified room
tr: Sınıf belirtilmemiş

# hrs
source: Hour
tr: Saat

source: Course details
tr: Ders detayları

source: Save
tr: Kaydet

# editCours
source: Edit the course
tr: Ders düzenle

# courseUpdated
source: Course modified !
tr: Ders düzenledi !

source: Course added !
tr: Ders eklendi !

# exactAlarmTitle
source: Allow exact alarms
tr: Kesin alarmlara izin verin

# exactAlarmMessage
source: To ensure scheduled reminders, enable the "Alarms & reminders" permission in system settings.
tr: Zamanlanmıs hatırlatmalar için "Alarmlar ve hatırlatmalar" iznini ayarlardan etkinlestirin.

# notificationPermissionTitle
source: Allow notifications
tr: Bildirimlere izin ver

# notificationPermissionMessage
source: To receive reminders, allow notifications in system settings.
tr: Hatırlatmaları almak için bildirimlere izin verin.

source: Later
tr: Sonra

source: Open settings
tr: Ayarları açın

# courseReminderTitle
source: Course reminder!
tr: Ders hatirlatması!

# courseReminderBody
source: Your course of {courseTitle} starts in 10 minutes{locationSuffix}.
tr: {courseTitle} dersiniz 10 dakika sonra basliyor{locationSuffix}.

# courseReminderLocationSuffix
source: in room {room}
tr: {room} odasında

source: Course not found
tr: Ders bulunamadı

# deleteCourseMessage
source: Do you really want to delete this course?
tr: Bu dersi silmek istiyor musunuz?

# testNotifButton
source: Test notification
tr: Bildirim test

# testInstantTitle
source: Instant test
tr: Anlik test

# testInstantBody
source: If you see this, the channel works!
tr: Bunu görüyorsaniz kanal calisiyor!

# versionLabel
source: Version {version}
tr: Surum {version}

source: Made with love by
tr: Sevgiyle hazırlandı:

source: ✓ Weekly notification scheduled
tr: ✓ Haftalık bildirim programlandı

# weeklyReminderMessage
source: Reminder every week 10 min before "{courseName}" on {date}
tr: "{courseName}" dersinden 10 dakika önce her hafta hatırlatma: {date}

source: Course too close
tr: Ders çok yakın

# courseTooCloseMessage
source: The course "{courseName}" is too close to schedule a notification.
tr: "{courseName}" dersi bildirim planlamak için çok yakın.

# notificationError
source: Notification error: {error}
tr: Bildirim hatası: {error}

# notificationInMinutes
source: in {minutes} min
tr: {minutes} dk sonra

# notificationInHoursMinutes
source: in {hours} h {minutes} min
tr: {hours} saat {minutes} dk sonra

# notificationOnDate
source: {dayShort} {day}/{month} at {hour}:{minute}
tr: {dayShort} {day}/{month} saat {hour}:{minute}

# shareNoteImage
source: Image from my note
tr: Notumdan görsel

# charactersCount
source: {count} characters
tr: {count} karakter

# requiredField
source: Required *
tr: Gerekli *
